Tekla Open API Reference for Tekla Structures 2025
Localization Constructor
 Creates a new localization instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Localization()
Public Sub New
See Also
Reference
Localization Class
Localization Overload
Tekla.Structures.Dialog Namespace